/*
Завдання №25 - щасливий квиток.
Визначити, чи є ціле 6-значне число "щасливим" квитком.
*/
#include <stdio.h>

int main() {
  // Ініціалізація змінних
  int number = 111030; // Номер нашого квитика
  int sum1 = 0; // Змінна, що буде містити суму перших трьох цифр квитка
  int sum2 = 0; // Змінна, що буде містити суму других трьох цифр квитка
  int is_lucky = 0; // Змінна, що буде містити значення чи є квиток щасливим

  sum1 += number % 10;
  number /= 10;
  sum1 += number % 10;
  number /= 10;
  sum1 += number % 10;
  number /= 10;

  sum2 += number % 10;
  number /= 10;
  sum2 += number % 10;
  number /= 10;
  sum2 += number % 10;
  //за то без циклов :)

  if (sum1 == sum2) {
    is_lucky = 1;
  }
  return 0;
}
