/* 
Завдання №25 - щасливий квиток.
Визначити, чи є ціле 6-значне число "щасливим" квитком. 
*/
#include <stdio.h>

int main(){
// Ініціалізація змінних
    int number = 111030; // Номер нашого квитика
    int sum1 = 0; // Змінна, що буде містити суму перших трьох цифр квитка
    int sum2 = 0; // Змінна, що буде містити суму других трьох цифр квитка
    int is_lucky = 0; // Змінна, що буде містити значення чи є квиток щасливим

// Цикл, що додає перші 3 цифри до sum1 та інші 3 цифри до sum2, за допомогою тернарного оператора
    for (int i = 0; i < 6; i++, number /= 10 ){ // Кожної ітерації змінна "number" втрачає одну цифру з кінця
        if (i < 3){
            sum1 += number % 10;
        }
        else{
            sum2 += number % 10;
        }
    }

// Перевірка на тотожність sum1 та sum2
    if (sum1 == sum2){
        is_lucky = 1;
    }
    return 0;
}
